tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "ngrok/ngrok"
cask_args adopt: true
brew "ack"
brew "libpng"
brew "lz4"
brew "xz"
brew "little-cms2"
brew "apr-util"
brew "m4"
brew "autoconf"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "binutils"
brew "bzip2"
brew "gdbm"
brew "gettext"
brew "pcre2"
brew "glib"
brew "pkg-config"
brew "pcre"
brew "python@3.9"
brew "cloudflared"
brew "gmp"
brew "coreutils"
brew "libunistring"
brew "libidn2"
brew "libssh2"
brew "openldap"
brew "curl"
brew "cython"
brew "diffutils"
brew "docker-compose"
brew "libevent"
brew "libtasn1"
brew "nettle"
brew "p11-kit"
brew "gnutls"
brew "guile"
brew "expect"
brew "fasd"
brew "harfbuzz"
brew "leptonica"
brew "libbluray"
brew "pango"
brew "ffmpeg"
brew "libmagic"
brew "file-formula"
brew "findutils"
brew "fzf"
brew "mpfr"
brew "gawk"
brew "git"
brew "git-lfs"
brew "go"
brew "glide"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "gnu-which"
brew "gnupg"
brew "lua"
brew "qt@5"
brew "gnuplot"
brew "gobject-introspection"
brew "gpatch"
brew "gradle"
brew "gradle-completion"
brew "graphviz"
brew "grep"
brew "gzip"
brew "helm"
brew "htop"
brew "python@3.10"
brew "httpie"
brew "hub"
brew "jenv"
brew "oniguruma"
brew "jq"
brew "kubernetes-cli"
brew "ldns"
brew "less"
brew "libfido2"
brew "libxmlsec1"
brew "libyaml"
brew "luarocks"
brew "lynx"
brew "lzip"
brew "make"
brew "mas"
brew "moreutils", link: false, conflicts_with: ["parallel"]
brew "mvnvm"
brew "nano"
brew "netcat"
brew "nghttp2"
brew "nmap"
brew "node"
brew "nvm"
brew "opa"
brew "openssh"
brew "pandoc"
brew "parallel"
brew "tree"
brew "pass"
brew "perl"
brew "pinentry-mac"
brew "pipx"
brew "protobuf"
brew "pv"
brew "pwgen"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.8"
brew "ruby-build"
brew "rbenv"
brew "redir"
brew "rename"
brew "rsync"
brew "s-lang"
brew "screen"
brew "shellcheck"
brew "utf8proc"
brew "subversion"
brew "telnet"
brew "terraform"
brew "thefuck"
brew "tldr"
brew "tmux"
brew "unzip"
brew "vim"
brew "watch"
brew "wdiff"
brew "wget"
brew "xmlstarlet"
brew "yarn"
brew "yq"
brew "zlib"
cask "1password"
cask "airserver"
cask "alfred"
cask "appcleaner"
cask "authy"
cask "brave-browser"
cask "burp-suite"
cask "corretto17"
cask "datagrip"
cask "docker"
cask "figma"
cask "fluor"
cask "google-chrome"
cask "google-drive"
cask "gpg-suite-nightly"
cask "grammarly-desktop"
cask "iina"
cask "intellij-idea"
cask "istat-menus"
cask "iterm2"
cask "kaleidoscope"
cask "launchcontrol"
cask "logi-options-plus"
cask "microsoft-edge"
cask "miro"
cask "muzzle"
cask "ngrok"
cask "notion"
cask "postman"
cask "pycharm"
cask "spotify"
cask "slack"
cask "steam"
cask "sublime-merge"
cask "sublime-text"
cask "surfshark"
cask "temurin11"
cask "temurin8"
cask "visual-studio-code"
cask "webstorm"
cask "whatsapp"
cask "yubico-yubikey-manager"
cask "zoom"
mas "Amphetamine", id: 937984704
mas "BetterSnapTool", id: 417375580
mas "GoodNotes", id: 1444383602
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
